ais_admin/frontend/controllers/MstyleController.php

	public function actionAdd()
    {
		$request = \YII::$app->request;
		$style=$request->post("style");
        $style_img = $request->post("style_img");

		$data = (new \yii\db\Query())
			->select(['*'])
			->from('ais_style')
			->where(['style_name'=>$style])
			->all();
---
SELECT * FROM `ais_style` WHERE `style_name`='gfddfstyle_img=./images/1487234671.jpg'

	public function actionList(){

		//实例化query
		$query=new Query();

		$query->from('ais_style');

		//分页
		$pagination = new Pagination(['totalCount' => $query->count()]);

		//条数
		$pagination->setPageSize('5');

		//条件
		$query->offset($pagination->offset)->limit($pagination->limit);

		//执行
		$userInfo=$query->all();
---
SELECT COUNT(*) FROM `ais_style`
SELECT * FROM `ais_style` LIMIT 5