ais_admin/frontend/controllers/SongController.php

	public function actionIndex(){

		//查询歌曲风格
		$styleObj = new Style();
		$styleList = $styleObj->find()->asArray()->all();
		//查询所有语种
		$languagesObj = new languages();
		$langList  = $languagesObj->find()->asArray()->all();
		//查询所有专辑
		$speciaObj = new Special();
		$speciList = $speciaObj->find()->asArray()->all();
---
SELECT * FROM `ais_style`
SELECT * FROM `ais_special`

	public function actionShow(){
		//所有语种
		$langObj = new Languages();
		$langList = $langObj->find()->asArray()->all();
		//所有风格
		$styleObJ = new Style();
		$styleList = $styleObJ->find()->asArray()->all();
---
SELECT * FROM `ais_languages`
SELECT * FROM `ais_style`

	public function actionDiscuss(){
		$request = \Yii::$app->request;
		$search1 = $request->post("search");
		$search2 = $request->get("search");
		$search  = empty($search1) ? $search2 : $search1;
		if(!empty($search)){
			$data = AisComment::find()->select('*')
			->innerJoin('ais_music','ais_comment.music_id=ais_music.music_id')
			->innerJoin('ais_user','ais_comment.user_id=ais_user.user_id')
			->where(['like','music_name',$search]); //联查
			// var_dump($data);die;
		}else{
			$data = AisComment::find()->select('*')
			->innerJoin('ais_music','ais_comment.music_id=ais_music.music_id')
			->innerJoin('ais_user','ais_comment.user_id=ais_user.user_id');; //联查
			// var_dump($data);die;
       }
        $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '15']);
	        $model = $data->offset($pages->offset)->limit($pages->limit)->asArray()->all(); //分页
---
SELECT COUNT(*) FROM `ais_comment` INNER JOIN `ais_music` ON ais_comment.music_id=ais_music.music_id INNER JOIN `ais_user` ON ais_comment.user_id=ais_user.user_id
SELECT * FROM `ais_comment` INNER JOIN `ais_music` ON ais_comment.music_id=ais_music.music_id INNER JOIN `ais_user` ON ais_comment.user_id=ais_user.user_id LIMIT 15