ais_admin/frontend/controllers/SpecialController.php

SELECT * FROM `ais_languages`
SELECT * FROM `ais_style`
---
    public function actionGetlanguage()
    {
        $language = new languages();
        $style = new style();
        return ['language'=>$language::find()->asArray()->all(),'style'=>$style::find()->asArray()->all()];